Data/Varying threads (only workload A, constant record count, target)/mongo_threads/threads_16/output.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 2489
[OVERALL], Throughput(ops/sec), 2008.8388911209322
[TOTAL_GCS_PS_Scavenge], Count, 5
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 47
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.888308557653676
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 47
[TOTAL_GC_TIME_%], Time(%), 1.888308557653676
[READ], Operations, 4724
[READ], AverageLatency(us), 4791.43416596105
[READ], MinLatency(us), 314
[READ], MaxLatency(us), 276223
[READ], 95thPercentileLatency(us), 13087
[READ], 99thPercentileLatency(us), 24463
[READ], Return=OK, 4724
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 644.9375
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 10319
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 10319
[UPDATE], Operations, 276
[UPDATE], AverageLatency(us), 6458.851449275362
[UPDATE], MinLatency(us), 491
[UPDATE], MaxLatency(us), 194815
[UPDATE], 95thPercentileLatency(us), 13423
[UPDATE], 99thPercentileLatency(us), 28127
[UPDATE], Return=OK, 276